In [1]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in /opt/conda/lib/python3.10/site-packages (0.5.0)
Requirement already satisfied: prettytable in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (3.7.0)
Requirement already satisfied: sqlparse in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: ipython-genutils in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: ipython in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (8.11.0)
Requirement already satisfied: sqlalchemy>=2.0 in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (2.0.7)
Requirement already satisfied: six in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: typing-extensions>=4.2.0 in /opt/conda/lib/python3.10/site-packages (from sqlalchemy>=2.0->ipython-sql) (4.5.0)
Requirement already satisfied: greenlet!=0.4.17 in /opt/conda/lib/python3.10/site-packages (from sqlalchemy>=2.0->ipython-sql) (2.0.2)
Requirement already satisfied: pygments>=2.4.0 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (2.14.0)
Requirement already satisfied: traitlets>=5 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (5.9.0)
Requirement already satisfied: backcall in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: pickleshare in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: stack-data in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.6.2)
Requirement already satisfied: matplotlib-inline in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: decorator in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: pexpect>4.3 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (4.8.0)
Requirement already satisfied: prompt-toolkit!=3.0.37,<3.1.0,>=3.0.30 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (3.0.38)
Requirement already satisfied: jedi>=0.16 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.18.2)
Requirement already satisfied: wcwidth in /opt/conda/lib/python3.10/site-packages (from prettytable->ipython-sql) (0.2.6)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in /opt/conda/lib/python3.10/site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /opt/conda/lib/python3.10/site-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Requirement already satisfied: pure-eval in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Requirement already satisfied: executing>=1.2.0 in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (1.2.0)
Requirement already satisfied: asttokens>=2.1.0 in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (2.2.1)
WARNING: There was an error checking the latest version of pip.

In [2]:
%load_ext sql

In [3]:
!env | grep POST

POSTGRESQL_USER=reader
POSTGRESQL_PASSWORD=Miba2021

In [4]:
import os
USER = os.environ['POSTGRESQL_USER']
PASSWORD = os.environ['POSTGRESQL_PASSWORD']
POSTGRESQL_HOST = '10.129.0.25'
DBASE_NAME = 'demo'

In [5]:
CONNECT_DATA = 'postgresql://{}:{}@{}/{}'.format(
    USER,
    PASSWORD,
    POSTGRESQL_HOST,
    DBASE_NAME
)

In [6]:
# task 1.1

In [7]:
%%sql $CONNECT_DATA
    SELECT t.passenger_name, a.city
    FROM tickets t, airports a
    WHERE t.ticket_no = '0005432312164'
    AND a.airport_code in(
        SELECT arrival_airport
        FROM flights
        WHERE flight_id in(
            SELECT flight_id
            FROM ticket_flights
            WHERE ticket_no = '0005432312164'))

3 rows affected.

[('ALEKSEY GERASIMOV', 'Anapa'),
 ('ALEKSEY GERASIMOV', 'Moscow'),
 ('ALEKSEY GERASIMOV', 'Belgorod')]

In [8]:
# task 1.2

In [9]:
%%sql $CONNECT_DATA
    SELECT passenger_name, city
    FROM tickets t, airports a, ticket_flights tf, flights f
    WHERE t.ticket_no = '0005432312164'
    AND t.ticket_no = tf.ticket_no
    AND tf.flight_id = f.flight_id
    AND f.arrival_airport = a.airport_code

4 rows affected.

[('ALEKSEY GERASIMOV', 'Belgorod'),
 ('ALEKSEY GERASIMOV', 'Belgorod'),
 ('ALEKSEY GERASIMOV', 'Moscow'),
 ('ALEKSEY GERASIMOV', 'Anapa')]

In [10]:
# task 1.3

In [11]:
%%sql $CONNECT_DATA
    SELECT passenger_name, city
    FROM tickets 
    JOIN ticket_flights USING (ticket_no)
    JOIN flights USING (flight_id)
    JOIN airports ON flights.arrival_airport = airports.airport_code
    WHERE ticket_no = '0005432312164'

4 rows affected.

[('ALEKSEY GERASIMOV', 'Belgorod'),
 ('ALEKSEY GERASIMOV', 'Belgorod'),
 ('ALEKSEY GERASIMOV', 'Moscow'),
 ('ALEKSEY GERASIMOV', 'Anapa')]

In [12]:
# task 2

In [13]:
%%sql $CONNECT_DATA
    SELECT d.city AS departure_city, a.city AS arrival_city
    FROM Flights f
    JOIN Ticket_flights tf USING (flight_id)
    JOIN Tickets t USING (ticket_no)
    JOIN Airports d ON f.departure_airport = d.airport_code
    JOIN Airports a ON f.arrival_airport = a.airport_code
    WHERE t.passenger_name = 'ELLA DMITRIEVA'

7 rows affected.

[('Moscow', 'Yuzhno-Sakhalinsk'),
 ('Moscow', 'Khanty-Mansiysk'),
 ('Khanty-Mansiysk', 'Moscow'),
 ('Moscow', 'Yekaterinburg'),
 ('Yekaterinburg', 'Moscow'),
 ('Yekaterinburg', 'Magnetiogorsk'),
 ('Magnetiogorsk', 'Yekaterinburg')]

In [14]:
# task 3

In [15]:
%%sql $CONNECT_DATA
    SELECT model, Count(seat_no) seats
    FROM aircrafts a, seats s
    WHERE a.aircraft_code = s.aircraft_code
    Group by model
    Order by seats desc

9 rows affected.

[('Boeing 777-300', 402),
 ('Boeing 767-300', 222),
 ('Airbus A321-200', 170),
 ('Airbus A320-200', 140),
 ('Boeing 737-300', 130),
 ('Airbus A319-100', 116),
 ('Sukhoi Superjet-100', 97),
 ('Bombardier CRJ-200', 50),
 ('Cessna 208 Caravan', 12)]